docs(pipelines): auto-update PIPELINES.md [skip ci]
